Tutorials/featureCases/2D_HronTurekFSI3/constant/solid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
|       ______          _   __           ______                               |
|      / ____/  ___    / | / /          / ____/  ____   ____ _   ____ ___     |
|     / / __   / _ \  /  |/ /  ______  / /_     / __ \ / __ `/  / __ `__ \    |
|    / /_/ /  /  __/ / /|  /  /_____/ / __/    / /_/ // /_/ /  / / / / / /    |
|    \____/   \___/ /_/ |_/          /_/       \____/ \__,_/  /_/ /_/ /_/     |
|    Copyright (C) 2015 - 2022 EPFL                                           |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/solid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    plateFix
    {
        type            patch;
        nFaces          6;
        startFace       1149;
    }
    plate
    {
        type            mappedPatch;
        nFaces          216;
        startFace       1155;
        sampleMode      nearestPatchFaceAMI;
        sampleRegion    fluid;
        samplePatch     plate;
        AMIMethod       faceAreaWeightAMI;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1260;
        startFace       1371;
    }
)

// ************************************************************************* //
