Tutorials/featureCases/2D_HronTurekFSI3/constant/solid/thermoMechanicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      solverDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//- Thermal and Mechanical solver selection:
thermalSolver           fromLatestTime;
mechanicsSolver         largeStrainTotLag;
neutronicsSolver        fromLatestTime;
elementTransport        fromLatestTime;

//- Material and rhelogy treatment:
materialProperties      byZone;
rheology                byMaterial;

heatSource              fromLatestTime;
burnup                  fromLatestTime;
fastFlux                fromLatestTime;
corrosion               fromLatestTime;
gapGas                  none;
fgr                     none;
sliceMapper             none;
corrosion               fromLatestTime;

globalOptions
{
    pinDirection            (0 0 1);
    reactorType             "LWR";
    angularFraction 1;
}

thermalSolverOptions
{
    heatFluxSummary     off;
}


mechanicsSolverOptions
{
    
}

couplingOptions
{
    correctDispForNeutro no;
}


materials
{


    rubber
    {
        material        constant;
        Cp          Cp      [0 2 -2 -1 0]   600;
        k           k       [1 1 3 -1 0]    15;
        emissivity emissivity [0 0 0 0 0]   0.0;
        rho     rho [1 -3 0 0 0 0 0] 1000;
        E       E [1 -1 -2 0 0 0 0] 5.6e6;
        nu      nu [0 0 0 0 0 0 0] 0.4;
        //G           G       [1 -1 -2 0 0]   0.0;
        alpha       alpha   [0 0 0 0 0]     0;
        Tref        Tref    [0 0 0 1 0]     648.156;

        rheologyModel hyperElasticity;
    }

}

// ************************************************************************* //
