Tutorials/featureCases/2D_HronTurekFSI3/0/fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
|       ______          _   __           ______                               |
|      / ____/  ___    / | / /          / ____/  ____   ____ _   ____ ___     |
|     / / __   / _ \  /  |/ /  ______  / /_     / __ \ / __ `/  / __ `__ \    |
|    / /_/ /  /  __/ / /|  /  /_____/ / __/    / /_/ // /_/ /  / / / / / /    |
|    \____/   \___/ /_/ |_/          /_/       \____/ \__,_/  /_/ /_/ /_/     |
|    Copyright (C) 2015 - 2022 EPFL                                           |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    plate
    {
        type zeroGradient;
        value uniform 0;
    }
    outlet
    {
        type fixedValue;
        value uniform 0;
    }
    inlet
    {
        type zeroGradient;
        value uniform 0;
    }
    cylinder
    {
        type zeroGradient;
        value uniform 0;
    }
    bottom
    {
        type zeroGradient;
        value uniform 0;
    }
    top
    {
        type zeroGradient;
        value uniform 0;
    }
    frontAndBackPlanes
    {
        type empty;
    }
}

// ************************************************************************* //
