Tutorials/featureCases/2D_HronTurekFSI3/system/fluid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
|       ______          _   __           ______                               |
|      / ____/  ___    / | / /          / ____/  ____   ____ _   ____ ___     |
|     / / __   / _ \  /  |/ /  ______  / /_     / __ \ / __ `/  / __ `__ \    |
|    / /_/ /  /  __/ / /|  /  /_____/ / __/    / /_/ // /_/ /  / / / / / /    |
|    \____/   \___/ /_/ |_/          /_/       \____/ \__,_/  /_/ /_/ /_/     |
|    Copyright (C) 2015 - 2022 EPFL                                           |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Euler;
}

gradSchemes
{
    default leastSquares;
}

divSchemes
{
    default none;
    div(phi,U) Gauss linearUpwind cellLimited leastSquares 1;
    div(meshPhi,p) Gauss linearUpwind cellLimited leastSquares 1;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div((nuEff*dev(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default none;
    laplacian((rho*nuEff),U) Gauss linear corrected;
    laplacian((1|A(U)),p) Gauss linear corrected;
    laplacian(diffusivity,cellMotionU) Gauss linear corrected;

    laplacian(rhorAUf,p) Gauss linear corrected;
}

interpolationSchemes
{
    default linear;
    interpolate(U) skewCorrected linear;
}

snGradSchemes
{
    default corrected;
}

fluxRequired
{
    default no;
    p;
}

// ************************************************************************* //
