Tutorials/featureCases/2D_HronTurekFSI3/system/solid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
|       ______          _   __           ______                               |
|      / ____/  ___    / | / /          / ____/  ____   ____ _   ____ ___     |
|     / / __   / _ \  /  |/ /  ______  / /_     / __ \ / __ `/  / __ `__ \    |
|    / /_/ /  /  __/ / /|  /  /_____/ / __/    / /_/ // /_/ /  / / / / / /    |
|    \____/   \___/ /_/ |_/          /_/       \____/ \__,_/  /_/ /_/ /_/     |
|    Copyright (C) 2015 - 2022 EPFL                                           |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

d2dt2Schemes
{
    default            Euler;
}

ddtSchemes
{
    default            backward;
}

gradSchemes
{
    default            leastSquares 0;
}

divSchemes
{
    default            Gauss linear;
}

laplacianSchemes
{
    default            none;
    laplacian(DD,D)    Gauss linear corrected;
    laplacian(DDD,DD)  Gauss linear corrected;
}

snGradSchemes
{
    default            none;
    snGrad(D)          corrected;
    snGrad(DD)         corrected;
}

interpolationSchemes
{
    default            none;
    interpolate(impK)  linear;
    interpolate(grad(D)) linear;
    interpolate(grad(DD)) linear;    
    interpolate(twoMuLambda) linear;
}

// ************************************************************************* //
